Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Password reset. Prevents new e-mails from being sent, avoiding spamming users with too many password-reset attempts.
sv: Ã terstÃ¤llning av lÃ¶senord. FÃ¶rhindrar att nya e-postmeddelanden skickas, vilket undviker att anvÃ¤ndare spammades med fÃ¶r mÃ¥nga fÃ¶rsÃ¶k att Ã¥terstÃ¤lla lÃ¶senordet.

source: Defaults to 10.
sv: StandardvÃ¤rdet Ã¤r 10.

source: Updates all repositories on a daily basis.
sv: Uppdaterar alla arkiv dagligen.

source: Useful if you are not using :ref:`hooks` to update Weblate repositories automatically.
sv: AnvÃ¤ndbart om du inte anvÃ¤nder :ref:`hooks` fÃ¶r att uppdatera Weblate-arkiv automatiskt.

source: On/off options exist in addition to string selection for backward compatibility.
sv: On/off-alternativ finns utÃ¶ver strÃ¤ngval fÃ¶r bakÃ¥tkompatibilitet.

source: The options are:
sv: Alternativen Ã¤r:

source: No daily updates.
sv: Inga dagliga uppdateringar.

source: ``"remote"`` also ``False``
sv: ``"fjÃ¤rr"`` ocksÃ¥ ``False``

source: Only update remotes.
sv: Uppdatera endast fjÃ¤rrkontroller.

source: ``"full"`` also ``True``
sv: ``"full"`` Ã¤ven ``True``

source: Update remotes and merge working copy.
sv: Uppdatera fjÃ¤rrkontroller och slÃ¥ samman arbetskopian.

source: This requires that :ref:`celery` is working, and will take effect after it is restarted.
sv: Detta krÃ¤ver att :ref:`celery` fungerar och trÃ¤der i kraft efter omstart.

source: Prefix for constructing avatar URLs as: ``${AVATAR_URL_PREFIX}/avatar/${MAIL_HASH}?${PARAMS}``. The following services are known to work:
sv: Prefix fÃ¶r att skapa avatar-URL:er som: ``${AVATAR_URL_PREFIX}/avatar/${MAIL_HASH}?${PARAMS}``. FÃ¶ljande tjÃ¤nster Ã¤r kÃ¤nda fÃ¶r att fungera:

source: Gravatar (default), as per https://gravatar.com/
sv: Gravatar (standard), enligt https://gravatar.com/

source: Libravatar, as per https://www.libravatar.org/
sv: Libravatar, enligt https://www.libravatar.org/

source: How long the authentication token and temporary password from password reset e-mails is valid for. Set in number of seconds, defaulting to 172800 (2 days).
sv: Hur lÃ¤nge autentiseringstoken och tillfÃ¤lligt lÃ¶senord frÃ¥n e-postmeddelanden om Ã¥terstÃ¤llning av lÃ¶senord Ã¤r giltiga. Anges i antal sekunder, standardvÃ¤rdet Ã¤r 172800 (2 dagar).

source: How many days Weblate rejects reusing a previously used password for a user.
sv: Hur mÃ¥nga dagar Weblate avvisar Ã¥teranvÃ¤ndning av ett tidigare anvÃ¤nt lÃ¶senord fÃ¶r en anvÃ¤ndare.

source: The checking is based on the audit log, :setting:`AUDITLOG_EXPIRY` needs to be at least same as this.
sv: Kontrollen baseras pÃ¥ revisionsloggen, :setting:`AUDITLOG_EXPIRY` mÃ¥ste vara minst lika med denna.

source: Password changes made prior to Weblate 2.15 will not be accounted for in this policy.
sv: LÃ¶senordsÃ¤ndringar som gjorts fÃ¶re Weblate 2.15 kommer inte att beaktas i denna policy.

source: List of automatic fixes to apply when saving a string.
sv: Lista Ã¶ver automatiska korrigeringar som ska tillÃ¤mpas vid sparande av en strÃ¤ng.

source: Provide a fully-qualified path to the Python class that implements the autofixer interface.
sv: Ange en fullstÃ¤ndig sÃ¶kvÃ¤g till Python-klassen som implementerar autofixer-grÃ¤nssnittet.

source: Available fixes are described at :ref:`autofix`.
sv: TillgÃ¤ngliga korrigeringar beskrivs pÃ¥ :ref:`autofix`.

source: You can select which ones to use:
sv: Du kan vÃ¤lja vilka du vill anvÃ¤nda:

source: Defines how often lengthy maintenance tasks should be triggered for a component.
sv: Definierar hur ofta lÃ¥ngvariga underhÃ¥llsuppgifter ska utlÃ¶sas fÃ¶r en komponent.

source: Right now this controls:
sv: Just nu styr detta:

source: :ref:`addon-weblate.autotranslate.autotranslate` add-on
sv: :ref:`addon-weblate.autotranslate.autotranslate` tillÃ¤gg

source: :doc:`checks` recalculation
sv: :doc:`checks` omrÃ¤kning

source: Possible choices:
sv: MÃ¶jliga val:

source: ``monthly`` (this is the default)
sv: ``mÃ¥nadsvis`` (detta Ã¤r standardinstÃ¤llningen)

source: Increasing the frequency is not recommended when Weblate contains thousands of components.
sv: Det rekommenderas inte att Ã¶ka frekvensen nÃ¤r Weblate innehÃ¥ller tusentals komponenter.

source: List of languages to offer users for starting a new translation. When not specified, a built-in list is used (which includes all commonly used languages, but without country specific variants).
sv: Lista Ã¶ver sprÃ¥k som anvÃ¤ndarna kan vÃ¤lja fÃ¶r att pÃ¥bÃ¶rja en ny Ã¶versÃ¤ttning. Om inget anges anvÃ¤nds en inbyggd lista (som innehÃ¥ller alla vanliga sprÃ¥k, men utan landsspecifika varianter).

source: This only limits non privileged users to add unwanted languages. Project admins are still presented with the full selection of languages defined in Weblate.
sv: Detta begrÃ¤nsar endast icke-privilegierade anvÃ¤ndare frÃ¥n att lÃ¤gga till oÃ¶nskade sprÃ¥k. ProjektadministratÃ¶rer har fortfarande tillgÃ¥ng till hela urvalet av sprÃ¥k som definierats i Weblate.

source: This does not define new languages for Weblate â it only filters existing ones in the database.
sv: Detta definierar inte nya sprÃ¥k fÃ¶r Weblate â det filtrerar endast befintliga sprÃ¥k i databasen.

source: You can pass additional arguments to :command:`borg create` when built-in backups are triggered.
sv: Du kan skicka ytterligare argument till :command:`borg create` nÃ¤r inbyggda sÃ¤kerhetskopior aktiveras.

source: Directory where Weblate stores cache files. Defaults to :file:`cache` subfolder in :setting:`DATA_DIR`.
sv: Katalog dÃ¤r Weblate lagrar cachefiler. StandardinstÃ¤llningen Ã¤r :file:`cache`-underkatalogen i :setting:`DATA_DIR`.

source: Change this to local or temporary filesystem if :setting:`DATA_DIR` is on a network filesystem.
sv: Ãndra detta till lokalt eller tillfÃ¤lligt filsystem om :setting:`DATA_DIR` finns pÃ¥ ett nÃ¤tverksfilsystem.

source: The Docker container uses a separate volume for this, see :ref:`docker-volume`.
sv: Docker-containern anvÃ¤nder en separat volym fÃ¶r detta, se :ref:`docker-volume`.

source: The following subdirectories usually exist:
sv: FÃ¶ljande underkataloger finns vanligtvis:

source: :program:`font-config` cache for :ref:`fonts`.
sv: :program:`font-config` cache fÃ¶r :ref:`fonts`.

source: Cached user avatars, see :ref:`avatars`.
sv: Cachade anvÃ¤ndaravatarer, se :ref:`avatars`.

source: Default location for static Django files, specified by :setting:`django:STATIC_ROOT`. See :ref:`static-files`.
sv: Standardplats fÃ¶r statiska Django-filer, angiven av :setting:`django:STATIC_ROOT`. Se :ref:`static-files`.

source: OCR trained data for :ref:`screenshots`.
sv: OCR-trÃ¤nade data fÃ¶r :ref:`screenshots`.

source: Customize the :http:header:`Content-Security-Policy` header for Weblate. The header is automatically generated based on enabled integrations with third-party services (Matomo, Google Analytics, Sentry, â¦).
sv: Anpassa :http:header:`Content-Security-Policy`-rubriken fÃ¶r Weblate. Rubriken genereras automatiskt baserat pÃ¥ aktiverade integrationer med tredjepartstjÃ¤nster (Matomo, Google Analytics, Sentry, â¦).

source: All these default to an empty list.
sv: Alla dessa Ã¤r som standard instÃ¤llda pÃ¥ en tom lista.

source: List of quality checks to perform on a translation.
sv: Lista Ã¶ver kvalitetskontroller som ska utfÃ¶ras pÃ¥ en Ã¶versÃ¤ttning.

source: Provide a fully-qualified path to the Python class implementing the check interface.
sv: Ange en fullstÃ¤ndig sÃ¶kvÃ¤g till Python-klassen som implementerar kontrollgrÃ¤nssnittet.

source: Adjust the list of checks to include ones relevant to you.
sv: Justera listan med kontroller sÃ¥ att den innehÃ¥ller de som Ã¤r relevanta fÃ¶r dig.

source: All built-in :ref:`checks` are turned on by default, from where you can change these settings. By default they are commented out in :ref:`sample-configuration` so that default values are used. New checks are then carried out for each new Weblate version.
sv: Alla inbyggda :ref:`checks` Ã¤r aktiverade som standard, och du kan Ã¤ndra dessa instÃ¤llningar dÃ¤r. Som standard Ã¤r de kommenterade i :ref:`sample-configuration` sÃ¥ att standardvÃ¤rdena anvÃ¤nds. Nya kontroller utfÃ¶rs sedan fÃ¶r varje ny version av Weblate.

source: You can turn off all checks:
sv: Du kan stÃ¤nga av alla kontroller:

source: You can turn on only a few:
sv: Du kan bara aktivera nÃ¥gra fÃ¥:

source: Changing this setting only affects newly changed translations. Existing checks will still be stored in the database. To also apply changes to the stored translations, run :wladmin:`updatechecks`.
sv: Ãndring av denna instÃ¤llning pÃ¥verkar endast nyÃ¤ndrade Ã¶versÃ¤ttningar. Befintliga kontroller kommer fortfarande att lagras i databasen. FÃ¶r att Ã¤ven tillÃ¤mpa Ã¤ndringarna pÃ¥ de lagrade Ã¶versÃ¤ttningarna, kÃ¶r :wladmin:`updatechecks`.

source: Delete comments after a given number of days. Defaults to ``None``, meaning no deletion at all.
sv: Ta bort kommentarer efter ett visst antal dagar. StandardinstÃ¤llningen Ã¤r ``Ingen``, vilket innebÃ¤r att inga kommentarer tas bort.

source: Number of hours between committing pending changes by way of the background task.
sv: Antal timmar mellan att bekrÃ¤fta vÃ¤ntande Ã¤ndringar genom bakgrundsuppgiften.

source: Configures how e-mail from the contact form is being sent. Choose a configuration that matches the configuration of your mail server.
sv: Konfigurerar hur e-post frÃ¥n kontaktformulÃ¤ret skickas. VÃ¤lj en konfiguration som matchar konfigurationen fÃ¶r din e-postserver.

source: The sender is used in as :mailheader:`Reply-To`, this is the default behaviour.
sv: AvsÃ¤ndaren anvÃ¤nds i :mailheader:`Reply-To`, detta Ã¤r standardinstÃ¤llningen.

source: The sender is used in as :mailheader:`From`. Your mail server needs to allow sending such e-mails.
sv: AvsÃ¤ndaren anvÃ¤nds i :mailheader:`From`. Din e-postserver mÃ¥ste tillÃ¥ta att sÃ¥dana e-postmeddelanden skickas.

source: Disables the contact form entirely.
sv: Inaktiverar kontaktformulÃ¤ret helt.

source: The folder Weblate stores all data in. It contains links to VCS repositories, a fulltext index and various configuration files for external tools.
sv: Mappen dÃ¤r Weblate lagrar all data. Den innehÃ¥ller lÃ¤nkar till VCS-arkiv, ett fulltextindex och olika konfigurationsfiler fÃ¶r externa verktyg.

source: Home directory used for invoking scripts.
sv: Hemkatalog som anvÃ¤nds fÃ¶r att anropa skript.

source: SSH keys and configuration.
sv: SSH-nycklar och konfiguration.

source: Default location for Django media files, specified by :setting:`django:MEDIA_ROOT`. Contains uploaded screenshots, see :ref:`screenshots`.
sv: Standardplats fÃ¶r Django-mediefiler, angiven av :setting:`django:MEDIA_ROOT`. InnehÃ¥ller uppladdade skÃ¤rmdumpar, se :ref:`screenshots`.

source: Version-control repositories for translations.
sv: VersionskontrollfÃ¶rvar fÃ¶r Ã¶versÃ¤ttningar.

source: Daily backup data. Please check :ref:`backup-dumps` for details.
sv: Daglig sÃ¤kerhetskopiering av data. Se :ref:`backup-dumps` fÃ¶r mer information.

source: User-uploaded fonts, see :ref:`fonts`.
sv: AnvÃ¤ndaruppladdade teckensnitt, se :ref:`fonts`.

source: Various caches. Can be placed elsewhere using :setting:`CACHE_DIR`.
sv: Olika cacher. Kan placeras pÃ¥ annan plats med hjÃ¤lp av :setting:`CACHE_DIR`.

source: This directory has to be writable by Weblate. Running it as WSGI means the ``www-data`` user should have write access to it.
sv: Denna katalog mÃ¥ste vara skrivbar av Weblate. Att kÃ¶ra den som WSGI innebÃ¤r att anvÃ¤ndaren ``www-data`` bÃ¶r ha skrivbehÃ¶righet till den.

source: The easiest way to achieve this is to make the user the owner of the directory:
sv: Det enklaste sÃ¤ttet att uppnÃ¥ detta Ã¤r att gÃ¶ra anvÃ¤ndaren till Ã¤gare av katalogen:

source: Defaults to ``/home/weblate/data``, but it is expected to be configured.
sv: StandardinstÃ¤llningen Ã¤r ``/home/weblate/data``, men det fÃ¶rvÃ¤ntas att den konfigureras.

source: Whether the database backups should be stored as plain text, compressed or skipped. The authorized values are:
sv: Om databasbackuperna ska lagras som ren text, komprimeras eller hoppas Ã¶ver. De godkÃ¤nda vÃ¤rdena Ã¤r:

source: The default access-control setting for new projects:
sv: StandardinstÃ¤llningen fÃ¶r Ã¥tkomstkontroll fÃ¶r nya projekt:

source: Use :guilabel:`Custom` if you are managing ACL manually, which means not relying on the internal Weblate management.
sv: AnvÃ¤nd :guilabel:`Custom` om du hanterar ACL manuellt, vilket innebÃ¤r att du inte fÃ¶rlitar dig pÃ¥ den interna Weblate-hanteringen.

source: Configures whether :guilabel:`Automatically watch projects on contribution` should be turned on for new users. Defaults to ``True``.
sv: Konfigurerar om :guilabel:`Automatiskt bevaka projekt vid bidrag` ska vara aktiverat fÃ¶r nya anvÃ¤ndare. StandardinstÃ¤llningen Ã¤r ``True``.

source: The default value for component restriction.
sv: StandardvÃ¤rdet fÃ¶r komponentbegrÃ¤nsning.

source: Default commit messages for different operations, please check :ref:`component` for details.
sv: StandardbekrÃ¤ftelsemeddelanden fÃ¶r olika Ã¥tgÃ¤rder, se :ref:`component` fÃ¶r mer information.

source: Default add-ons to install for every created component.
sv: StandardtillÃ¤gg som ska installeras fÃ¶r varje skapad komponent.

source: This setting affects only newly created components.
sv: Denna instÃ¤llning pÃ¥verkar endast nyskapade komponenter.

source: Example:
sv: Exempel:

source: Committer e-mail address, defaulting to ``noreply@weblate.org``.
sv: Committer-e-postadress, standardinstÃ¤llningen Ã¤r ``noreply@weblate.org``.

source: Committer name, defaulting to ``Weblate``.
sv: Committer-namn, standardvÃ¤rdet Ã¤r ``Weblate``.

source: :ref:`component-source_language` for any new components.
sv: :ref:`component-source_language` fÃ¶r alla nya komponenter.

source: Defaults to `en`. The matching language object needs to exist in the database.
sv: StandardvÃ¤rdet Ã¤r `en`. Det matchande sprÃ¥komrÃ¥det mÃ¥ste finnas i databasen.

source: :ref:`component-merge_style` for any new components.
sv: :ref:`component-merge_style` fÃ¶r alla nya komponenter.

source: `rebase` - default
sv: `rebase` - standard

source: Configures the default value of :ref:`project-use_shared_tm` and :ref:`project-contribute_shared_tm`.
sv: Konfigurerar standardvÃ¤rdet fÃ¶r :ref:`project-use_shared_tm` och :ref:`project-contribute_shared_tm`.

source: Configures the default value of :ref:`project-autoclean_tm`.
sv: Konfigurerar standardvÃ¤rdet fÃ¶r :ref:`project-autoclean_tm`.

source: Default setting for translation propagation, defaults to ``True``.
sv: StandardinstÃ¤llning fÃ¶r Ã¶versÃ¤ttningsspridning, standardvÃ¤rdet Ã¤r ``True``.

source: Configures the default title and message for pull requests.
sv: Konfigurerar standardtitel och meddelande fÃ¶r pull-fÃ¶rfrÃ¥gningar.

source: Whether to turn on Gravatar-based avatars for users. On by default.
sv: Om Gravatar-baserade avatarer ska aktiveras fÃ¶r anvÃ¤ndare. Aktiverat som standard.

source: Avatars are fetched and cached on the server, lowering the risk of leaking private info, speeding up the user experience.
sv: Avatarer hÃ¤mtas och cachelagras pÃ¥ servern, vilket minskar risken fÃ¶r lÃ¤ckage av privat information och snabbar upp anvÃ¤ndarupplevelsen.

source: Whether to turn on anonymous remote hooks.
sv: Om anonyma fjÃ¤rrkopplingar ska aktiveras.

source: Weblate now requires https for WebAuthn support.
sv: Weblate krÃ¤ver nu https fÃ¶r stÃ¶d fÃ¶r WebAuthn.

source: Whether to send links to Weblate as HTTPS or HTTP. This setting affects sent e-mails and generated absolute URLs.
sv: Om lÃ¤nkar till Weblate ska skickas som HTTPS eller HTTP. Denna instÃ¤llning pÃ¥verkar skickade e-postmeddelanden och genererade absoluta URL:er.

source: In the default configuration this is also used for several Django settings related to HTTPS â it enables secure cookies, toggles HSTS or enables redirection to a HTTPS URL.
sv: I standardkonfigurationen anvÃ¤nds detta ocksÃ¥ fÃ¶r flera Django-instÃ¤llningar relaterade till HTTPS â det aktiverar sÃ¤kra cookies, vÃ¤xlar HSTS eller aktiverar omdirigering till en HTTPS-URL.

source: The HTTPS redirection might be problematic in some cases and you might hit an issue with infinite redirection in case you are using a reverse proxy doing an SSL termination which does not correctly pass protocol headers to Django. Please tweak your reverse proxy configuration to emit :http:header:`X-Forwarded-Proto` or :http:header:`Forwarded` headers or configure :setting:`django:SECURE_PROXY_SSL_HEADER` to let Django correctly detect the SSL status.
sv: HTTPS-omdirigering kan vara problematisk i vissa fall och du kan stÃ¶ta pÃ¥ problem med oÃ¤ndlig omdirigering om du anvÃ¤nder en omvÃ¤nd proxy som utfÃ¶r SSL-terminering som inte korrekt vidarebefordrar protokollhuvuden till Django. Justera din omvÃ¤nda proxykonfiguration sÃ¥ att den skickar :http:header:`X-Forwarded-Proto`- eller :http:header:`Forwarded`-huvuden, eller konfigurera :setting:`django:SECURE_PROXY_SSL_HEADER` sÃ¥ att Django korrekt kan upptÃ¤cka SSL-statusen.

source: In case this is disabled, Weblate will fail to start with an ``otp_webauthn.E031`` error. You can silence this error by adding it to :setting:`django:SILENCED_SYSTEM_CHECKS`, but still WebAuthn will not work for sites without HTTPS.
sv: Om detta Ã¤r inaktiverat kommer Weblate inte att kunna starta och ett felmeddelande med texten ``otp_webauthn.E031`` visas. Du kan dÃ¤mpa detta felmeddelande genom att lÃ¤gga till det i :setting:`django:SILENCED_SYSTEM_CHECKS`, men WebAuthn kommer fortfarande inte att fungera fÃ¶r webbplatser utan HTTPS.

source: Turn on/off the :guilabel:`Community` menu so users can share translation progress on social networks.
sv: Aktivera/inaktivera menyn :guilabel:`Community` sÃ¥ att anvÃ¤ndare kan dela Ã¶versÃ¤ttningsframsteg pÃ¥ sociala nÃ¤tverk.

source: Insert additional markup into the HTML header. Can be used for verification of site ownership, for example:
sv: Infoga ytterligare markeringar i HTML-rubriken. Kan anvÃ¤ndas fÃ¶r verifiering av webbplatsÃ¤gande, till exempel:

source: No sanitization is performed on the string. It is inserted as-is into the HTML header.
sv: StrÃ¤ngen saneras inte. Den infogas som den Ã¤r i HTML-rubriken.

source: URL where support for your Weblate instance can be found.
sv: URL dÃ¤r support fÃ¶r din Weblate-instans finns.

source: List for credentials for Gitea servers.
sv: Lista Ã¶ver inloggningsuppgifter fÃ¶r Gitea-servrar.

source: The configuration dictionary consists of credentials defined for each API host. The layout is same for almost all version control integrations and is described at :ref:`settings-credentials`.
sv: Konfigurationsordlistan bestÃ¥r av autentiseringsuppgifter som definieras fÃ¶r varje API-vÃ¤rd. Layouten Ã¤r densamma fÃ¶r nÃ¤stan alla versionshanteringsintegrationer och beskrivs i :ref:`settings-credentials`.

source: `Creating a Gitea personal access token`_
sv: `Skapa en personlig Ã¥tkomstnyckel fÃ¶r Gitea`_

source: List for credentials for GitLab servers.
sv: Lista Ã¶ver autentiseringsuppgifter fÃ¶r GitLab-servrar.

source: The personal access token needs the :guilabel:`api` scope to be able to use the API.
sv: Den personliga Ã¥tkomsttoken behÃ¶ver :guilabel:`api`-omfÃ¥nget fÃ¶r att kunna anvÃ¤nda API:et.

source: `GitLab: Personal access token <https://docs.gitlab.com/user/profile/personal_access_tokens/>`_
sv: `GitLab: Personlig Ã¥tkomsttoken <https://docs.gitlab.com/user/profile/personal_access_tokens/>`_

source: List for credentials for GitHub servers.
sv: Lista Ã¶ver autentiseringsuppgifter fÃ¶r GitHub-servrar.

source: It is possible to use both fine-grained personal access tokens and classic personal access tokens. The fine-grained tokens are limited to a single organization, so it won't work if you want Weblate to fork a repository outside the organization (typically to the user namespace).
sv: Det Ã¤r mÃ¶jligt att anvÃ¤nda bÃ¥de finfÃ¶rdelade personliga Ã¥tkomsttoken och klassiska personliga Ã¥tkomsttoken. De finfÃ¶rdelade token Ã¤r begrÃ¤nsade till en enda organisation, sÃ¥ det fungerar inte om du vill att Weblate ska fÃ¶rgrena ett arkiv utanfÃ¶r organisationen (vanligtvis till anvÃ¤ndarens namnomrÃ¥de).

source: To clone, push and create pull requests, the read and write access to :guilabel:`Contents` and :guilabel:`Pull requests` is required.
sv: FÃ¶r att klona, pusha och skapa pull-fÃ¶rfrÃ¥gningar krÃ¤vs lÃ¤s- och skrivbehÃ¶righet till :guilabel:`Contents` och :guilabel:`Pull requests`.

source: :guilabel:`Administration` might also be necessary for forking a repository if you intend to use forking and the original repository is not public.
sv: :guilabel:`Administration` kan ocksÃ¥ vara nÃ¶dvÃ¤ndigt fÃ¶r att fÃ¶rgrena ett arkiv om du avser att anvÃ¤nda fÃ¶rgrening och det ursprungliga arkivet inte Ã¤r offentligt.

source: Use ``api.github.com`` as a API host for https://github.com/.
sv: AnvÃ¤nd ``api.github.com`` som API-vÃ¤rd fÃ¶r https://github.com/.

source: `Creating a GitHub personal access token`_
sv: `Skapa en personlig Ã¥tkomsttoken fÃ¶r GitHub`_

source: List for credentials for Bitbucket Data Center.
sv: Lista Ã¶ver autentiseringsuppgifter fÃ¶r Bitbucket Data Center.

source: `Bitbucket: HTTP access token <https://confluence.atlassian.com/bitbucketserver/http-access-tokens-939515499.html>`_
sv: Bitbucket: HTTP-Ã¥tkomsttoken <https://confluence.atlassian.com/bitbucketserver/http-access-tokens-939515499.html>

source: List for credentials for Bitbucket Cloud servers.
sv: Lista Ã¶ver autentiseringsuppgifter fÃ¶r Bitbucket Cloud-servrar.

source: The configuration dictionary consists of credentials defined for each API host. The API host might be different from what you use in the web browser, for example GitHub API is accessed as ``api.github.com``.
sv: Konfigurationsordlistan bestÃ¥r av autentiseringsuppgifter som definieras fÃ¶r varje API-vÃ¤rd. API-vÃ¤rden kan skilja sig frÃ¥n den du anvÃ¤nder i webblÃ¤saren, till exempel nÃ¥s GitHub API som ``api.github.com``.

source: The following configuration is available for each host:
sv: FÃ¶ljande konfiguration Ã¤r tillgÃ¤nglig fÃ¶r varje vÃ¤rd:

source: API user.
sv: API-anvÃ¤ndare.

source: The user workspace slug.
sv: AnvÃ¤ndarens arbetsytaslugg.

source: The API token with `pullrequest:write` permission.
sv: API-token med behÃ¶righeten `pullrequest:write`.

source: Additional settings not described here can be found at :ref:`settings-credentials`.
sv: Ytterligare instÃ¤llningar som inte beskrivs hÃ¤r finns pÃ¥ :ref:`settings-credentials`.

source: `Create an API token <https://support.atlassian.com/bitbucket-cloud/docs/create-an-api-token/>`_
sv: `Skapa en API-token <https://support.atlassian.com/bitbucket-cloud/docs/create-an-api-token/>`_

source: `API token permissions <https://support.atlassian.com/bitbucket-cloud/docs/api-token-permissions/>`_
sv: `API-tokenbehÃ¶righeter <https://support.atlassian.com/bitbucket-cloud/docs/api-token-permissions/>`_

source: List for credentials for Azure DevOps servers.
sv: Lista Ã¶ver autentiseringsuppgifter fÃ¶r Azure DevOps-servrar.

source: The name of the Azure DevOps project. This is not the repository name.
sv: Namnet pÃ¥ Azure DevOps-projektet. Detta Ã¤r inte namnet pÃ¥ arkivet.

source: The name of the organization of the project.
sv: Projektets organisationsnamn.

source: An optional list of work items IDs from your organization. When provided new pull requests will have these attached.
sv: En valfri lista med ID-nummer fÃ¶r arbetsuppgifter frÃ¥n din organisation. NÃ¤r dessa anges kommer nya pull-fÃ¶rfrÃ¥gningar att ha dessa bifogade.

source: API token for the API user, required.
sv: API-token fÃ¶r API-anvÃ¤ndaren, krÃ¤vs.
